TAX_RATE = 0.13 # Налог (процент)

income_amount = float(input("Введите сумму дохода: "))

tax_amount = income_amount * TAX_RATE # Сумма налога от суммы дохода
income_amount_inc_tax = income_amount - tax_amount #Сумма с учетом вычета налога

print(f"Общая сумма дохода составляет: {income_amount:_.2f}".replace('_',' ')) # до двух числе после запятой, разделяю тысячи на _ и меняя _ на пробел
print(f"Сумма  рассчитанного налога составляет: {tax_amount:_.2f}".replace('_',' ')) # до двух числе после запятой, разделяю тысячи на _ и меняя _ на пробел
print(f'Сумма  "на руки" после вычета налога составляет: {income_amount_inc_tax:_.2f}'.replace('_',' ')) # до двух числе после запятой, разделяю тысячи на _ и меняя _ на пробел