import math

# list_seats = [1, 2, 3, 4,
#               5, 6, 7, 8,
#               9, 10, 11, 12,
#               13, 14, 15, 16,
#               17, 18, 19, 20,           Этот список для наглядности
#               21, 22, 23, 24,
#               25, 26, 27, 28,
#               29, 30, 31, 32,
#               33, 34, 35, 36]

# Решая предыдущие варианты я смотрел и понимал, что там используются способы, которые мы не прошли, 
# я решил просто сделать список, похожий на словарь, но без ключей, я смотрел на него и думал, как мне сделать так, дабы это работало без сложностей.

# Меня осенило, что у нас есть список и номер в каждом купе всегда заканчивается на число, кратное четырём. 
# То есть при делении числа из первого ряда на четыре и округлив его нацело в большую сторону будет получаться номер купе!!!

seat = int(input('Введите номер места (1-36): '))

print('Ваше купе №',math.ceil(seat / 4))


