number = int(input("Введите четырёхзнычное число: "))

print("Цифра в позиции тысяч равна",number // 1000 ) #исходное Делим нацело на 1000
print("Цифра в позиции сотен равна",number // 100 - number // 1000 * 10 ) #исходное Делим нацело на 100 - исходное делим нацело на 1000 * 10
print("Цифра в позиции десятков равна",number // 10 - number // 100 * 10 ) #исходное Делим нацело на 10 - исходное делим нацело на 100 * 10
print("Цифра в позиции единиц равна",number - number // 10 * 10 ) #Исходное число - исходное делим нацело на 10 * 10
