list_seats = [1, 2, 3, 4,
              5, 6, 7, 8,
              9, 10, 11, 12,
              13, 14, 15, 16,
              17, 18, 19, 20,
              21, 22, 23, 24,
              25, 26, 27, 28,
              29, 30, 31, 32,
              33, 34, 35, 36]

seat = int(input('Введите номер места: '))

if 1 <= seat <= 4:
    print('Ваше купе №1')
elif 5 <= seat <= 8:
    print('Ваше купе №2')
elif 9 <= seat <= 12:
    print('Ваше купе №3')
elif 13 <= seat <= 16:
    print('Ваше купе №4')
elif 17 <= seat <= 20:
    print('Ваше купе №5')
elif 21 <= seat <= 24:
    print('Ваше купе №6')
elif 25 <= seat <= 28:
    print('Ваше купе №7')
elif 29 <= seat <= 32:
    print('Ваше купе №8')
elif 33 <= seat <= 36:
    print('Ваше купе №9')
else:
    print('Купе с таким номером отсутствует')