beige_squares = ('1 1','1 3','1 5','1 7',
                 '2 2','2 4','2 6','2 8',
                 '3 1','3 3','3 5','3 7',
                 '4 2','4 4','4 6','4 8',
                 '5 1','5 3','5 5','5 7',
                 '6 2','6 4','6 6','6 8',
                 '7 1','7 3','7 5','7 7',
                 '8 2','8 4','8 6','8 8')
orange_squares =('1 2','1 4','1 6','1 8',               # Увидев шахматную доску сразу вспомнил списки и решил использовать их (конкретно кортеж)
                 '2 1','2 3','2 5','2 7',
                 '3 2','3 4','3 6','3 8',
                 '4 1','4 3','4 5','4 7',
                 '5 2','5 4','5 6','5 8',
                 '6 1','6 3','6 5','6 7',
                 '7 2','7 4','7 6','7 8',
                 '8 1','8 3','8 5','8 7')

print('Вас приветствует программа, определяющая являются ли клетки шахматной доски одного цвета \n')

square_1 = input('Введите номер первой клетки шахматной доски 8x8 (два числа через пробел): ')
square_2 = input('Введите номер второй клетки шахматной доски 8x8 (два числа через пробел): ')

if (square_1 in beige_squares) and (square_2 in beige_squares) or (square_1 in orange_squares) and (square_2 in orange_squares):
    print('\nYES')

else:
    print('\nNO')