# Диагностика состояния здоровья

temperature = float(input('Укажите температуру своего тела (Цельсия): '))
pressure_upper = int(input('Укажите свое давление (верхнее): '))
pulse = int(input('Укажите свой пульс (уд/мин): '))

if (36 <= temperature <= 37) and (110 <= pressure_upper <= 130) and (60 <= pulse <= 100): # Температура 36-37°C, Давление 110-130, Пульс 60-100
    print('Ваше состояние в норме')

elif ((35 <= temperature < 36) or (37 < temperature <= 38)) and ((105 <= pressure_upper < 110) or (130 < pressure_upper <= 140)) and ((55 <= pulse < 60) or (100 < pulse <= 110)): # Температура: 35-36°C или 37-38°C, Давление: 105-110 или 130-140, Пульс: 55-60 или 100-110
    print('У вас лёгкое недомогание')

else:
    print('Вам срочно требуется врач!')